{
  "description": "Adds a job to a pipeline stage to a control or module repository  in a Continuous Delivery for PE workspace.",
  "parameters": {
    "email": {
      "type": "String[1]",
      "description": "The email address associated with the Continuous Delivery for PE login."
    },
    "password": {
      "type": "String[1]",
      "sensitive": true,
      "description": "The password associated with the account."
    },
    "base64_cacert": {
      "type": "Optional[String[1]]",
      "description": "The CA cert of the CD4PE instance, base64 encoded"
    },
    "insecure_https": {
      "type": "Optional[Boolean]",
      "description": "Whether or not to make the https calls without verifying the CA cert. Only use this on test systems."
    },
    "workspace": {
      "type": "String[1]",
      "description": "Designates the workspace that the repo and pipeline are associated with."
    },
    "repo_name": {
      "type": "String[1]",
      "description": "The name used for the repo in Continuous Delivery for PE."
    },
    "repo_type": {
      "type": "Enum['module', 'control']",
      "description": "The type of repository."
    },
    "branch_name": {
      "type": "String[1]",
      "description": "The branch name associated with the pipeline to add a stage to."
    },
    "job_name": {
      "type": "String[1]",
      "description": "The name associated with the job. If job names aren't unique then the task will fail."
    },
    "stage_name": {
      "type": "String[1]",
      "description": "The name of the stage that the job should be added to. The stage will be created if it doesn't exist."
    },
    "add_stage_after": {
      "type": "Optional[String[1]]",
      "description": "Optional. The name of the stage that we should add a new stage after. If not specified then the stage will be added to the end of the pipeline. Only applies if the stage doesn't exist"
    },
    "autopromote": {
      "type": "Optional[Boolean]",
      "description": "Optional. A boolean to indicate whether or not changes should be auto-promoted through this stage. The default value is false. Will update the existing settings on a stage if set."
    },
    "trigger_condition": {
      "type": "Optional[Enum['AllSuccess', 'AllComplete', 'AnySuccess', 'AnyComplete']]",
      "description": "Optional. The condition on which changes will promote to the next stage. This parameter is only applicable if 'autopromote' is set to true."
    },
    "resolvable_hostname": {
      "type": "Optional[String[1]]",
      "description": "Optional. A resolvable internet address where the Continuous Delivery for PE server can be reached. Required only if the agent certificate is not the machine's resolvable internet address."
    },
    "web_ui_endpoint": {
      "type": "Optional[String[1]]",
      "description": "Optional. The endpoint where the web UI can be reached, in the form http://<resolvable_hostname>:<port>. Required if you set the web_ui_port parameter in the cd4pe class during installation."
    }
  },
  "files": [
    "cd4pe/lib/puppet_x/puppetlabs/cd4pe_client.rb",
    "cd4pe/lib/puppet_x/puppetlabs/cd4pe_pipeline_utils.rb"
  ],

  "input_method": "stdin"
}
